# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

day_weak = int(input('Input day of weak: '))
if day_weak == 6 or day_weak == 7:
    print(f'{day_weak} -> да')
else:
    print(f'{day_weak} -> нет')